## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/40ee839d-f91d-483d-9194-26954aa8428f/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_configuration_key.activity_queue_key will be created
  + resource "azurerm_app_configuration_key" "activity_queue_key" {
      + configuration_store_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "biotrackr:activity-queue"
      + locked                 = false
      + type                   = "kv"
      + value                  = "activity-queue"
    }

  # module.activity_queue.azurerm_servicebus_queue.queue will be created
  + resource "azurerm_servicebus_queue" "queue" {
      + auto_delete_on_idle                     = (known after apply)
      + batched_operations_enabled              = (known after apply)
      + dead_lettering_on_message_expiration    = false
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + express_enabled                         = (known after apply)
      + id                                      = (known after apply)
      + lock_duration                           = (known after apply)
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "activity-queue"
      + namespace_id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae"
      + partitioning_enabled                    = (known after apply)
      + requires_duplicate_detection            = false
      + requires_session                        = false
      + status                                  = "Active"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_app_configuration_key.activity_queue_key will be created%0A  + resource "azurerm_app_configuration_key" "activity_queue_key" {%0A      + configuration_store_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae"%0A      + content_type           = (known after apply)%0A      + etag                   = (known after apply)%0A      + id                     = (known after apply)%0A      + key                    = "biotrackr:activity-queue"%0A      + locked                 = false%0A      + type                   = "kv"%0A      + value                  = "activity-queue"%0A    }%0A%0A  # module.activity_queue.azurerm_servicebus_queue.queue will be created%0A  + resource "azurerm_servicebus_queue" "queue" {%0A      + auto_delete_on_idle                     = (known after apply)%0A      + batched_operations_enabled              = (known after apply)%0A      + dead_lettering_on_message_expiration    = false%0A      + default_message_ttl                     = (known after apply)%0A      + duplicate_detection_history_time_window = (known after apply)%0A      + enable_batched_operations               = true%0A      + enable_express                          = false%0A      + enable_partitioning                     = false%0A      + express_enabled                         = (known after apply)%0A      + id                                      = (known after apply)%0A      + lock_duration                           = (known after apply)%0A      + max_delivery_count                      = 10%0A      + max_message_size_in_kilobytes           = (known after apply)%0A      + max_size_in_megabytes                   = (known after apply)%0A      + name                                    = "activity-queue"%0A      + namespace_id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae"%0A      + partitioning_enabled                    = (known after apply)%0A      + requires_duplicate_detection            = false%0A      + requires_session                        = false%0A      + status                                  = "Active"%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>